<html xmlns:fo="http://www.w3.org/1999/XSL/Format">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Colophon</title>
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="book.html" title="Jenkins : Le guide complet">
      <link rel="up" href="book.html" title="Jenkins : Le guide complet">
      <link rel="prev" href="ix01.html" title="Index">
   </head>
   <body>
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="ix01.html">Index</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="h" href="book.html">
                     												TOC
                                   </a></td>
               <td width="40%" align="right">&nbsp;</td>
            </tr>
         </table>
      </div>
      <div class="colophon" lang="en">
         <h2 class="title"><a name="colophon"></a>Colophon
         </h2>
         <p>L&#8217;animal sur la couverture de <span class="emphasis"><em>Jenkins : Le guide complet</em></span>
              est une grenouille faux-grillon orn&eacute;e (<span class="emphasis"><em>Pseudacris ornata</em></span>). On
            peut trouver ces petits amphibiens, de seulement 2,5 &agrave; 3,5 centim&egrave;tres de long, sur les plaines
            c&ocirc;ti&egrave;res d&#8217;Am&eacute;rique du Nord de la Caroline du Nord jusqu&#8217;au milieu de la Floride et
              dans l&#8217;est de la Louisiane. Ils pr&eacute;f&egrave;rent les zones d&#8217;eau peu profonde sans v&eacute;g&eacute;tation
              dense, telles que les mares, les foss&eacute;s de bord de route, et les pr&eacute;s inond&eacute;s.
         </p>
         <p>La couleur des grenouilles faux-grillons orn&eacute;es varie en fonction des endroits, et les
              individus peuvent &ecirc;tre principalement noir, blanc, marron, rouge, vert, ou toute
              autre variation proche. Quand bien m&ecirc;me, tous les sp&eacute;cimens, poss&egrave;dent une bande
              sombre ou un ensemble de taches allant des narines jusqu&#8217;en haut du dos en passant
              par l&#8217;oeil, et la plupart poss&egrave;dent aussi d&#8217;autres taches ou bandes. Les esp&egrave;ces
              se reproduisent de novembre &agrave; mars, et l&#8217;appel des m&acirc;les peut &ecirc;tre entendu dans
              ou &agrave; proximit&eacute; des zones d&#8217;eau peu profondes.
         </p>
         <p>Les grenouilles faux-grillons orn&eacute;es doivent &eacute;galement leur nom au son de leur champ
              nuptial : <span class="emphasis"><em>Pseudacris</em></span> vient du grec ancien signifiant
              &#8220;faux grillon&#8221;. Ce nom fut donn&eacute; en 1836 par le naturaliste am&eacute;ricain John
              Edwards Holbrook apr&egrave;s qu&#8217;il ait observ&eacute; que le son aigu ressemblait &agrave;
              celui produit par ce non moins c&eacute;l&egrave;bre insecte.
         </p>
         <p>L&#8217;image de couverture est tir&eacute;e de l&#8217;ouvrage <span class="emphasis"><em>Cassell&#8217;s Natural History</em></span>.
              La police d&#8217;&eacute;criture de la couverture est Adobe ITC Garamond. La police utilis&eacute;e
              pour le texte est Linotype Birka ; la police des titres est Adobe Myriad Condensed ;
              et la police utilis&eacute;e pour le code est LucasFont&#8217;s TheSansMonoCondensed.
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="ix01.html">Prev</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="h" href="book.html">Home</a></td>
               <td width="40%" align="right">&nbsp;</td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">Index&nbsp;</td>
               <td width="20%" align="center"><span style="color:white;font-size:90%;"><a href="http://www.sonatype.com/" title="Sonatype: Build Success for your Enterprise">Sponsored by Sonatype
                                                                </a></span></td>
               <td width="40%" align="right" valign="top">&nbsp;</td>
            </tr>
         </table>
      </div>
   </body>
</html>