<html xmlns:fo="http://www.w3.org/1999/XSL/Format">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Avant-propos</title>
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="book.html" title="Jenkins : Le guide complet">
      <link rel="up" href="book.html" title="Jenkins : Le guide complet">
      <link rel="prev" href="copyright.html" title="Copyright">
      <link rel="next" href="preface.html" title="Pr&eacute;face">
   </head>
   <body>
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="copyright.html">Copyright</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="h" href="book.html">
                     												TOC
                                           </a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="preface.html">Pr&eacute;face</a></td>
            </tr>
         </table>
      </div>
      <div class="preface" lang="en">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="foreword"></a>Avant-propos
                  </h2>
               </div>
               <div><span class="author"><span class="firstname">Kohsuke</span> <span class="surname">Kawaguchi</span> 
                                 (Cr&eacute;ateur du projet Jenkins et Architecte chez
                             CloudBees)
                                 </span></div>
            </div>
         </div>
         <p>Il y a 7 ans, j&#8217;&eacute;crivais la premi&egrave;re ligne de code qui a d&eacute;marr&eacute;
              le projet aujourd&#8217;hui connu sous le nom de Jenkins, et qui s&#8217;appelait
              &agrave; l&#8217;origine Hudson. J&#8217;avais l&#8217;habitude d&#8217;&ecirc;tre celui qui cassait le build<sup>[<a name="d0e192" href="#ftn.d0e192">1</a>]</sup>,
            j&#8217;avais donc besoin d&#8217;un programme qui d&eacute;tecte mes erreurs avant que mes
            coll&egrave;gues ne le fassent. C&#8217;&eacute;tait alors un outil simple qui faisait une chose
              simple. Cependant, cet outil a rapidement &eacute;volu&eacute; et j&#8217;aime &agrave; penser aujourd&#8217;hui qu&#8217;il est devenu
              le serveur d&#8217;int&eacute;gration continue le plus r&eacute;pandu sur le march&eacute;, englobant un large
              &eacute;cosyst&egrave;me de plugins, des distributions commerciales, du
              Jenkins-as-a-Service h&eacute;berg&eacute;, des groupes utilisateurs, des rencontres
              utilisateurs, des formations, etc.
         </p>
         <p>Comme la plupart de mes autres projets, celui-ci a &eacute;t&eacute; rendu open source d&egrave;s
              sa cr&eacute;ation. Au cours de sa vie, il a repos&eacute; essentiellement sur l&#8217;aide
              et l&#8217;amour d&#8217;autres personnes, sans lesquelles ce projet ne serait pas dans
              son &eacute;tat actuel. Durant cette p&eacute;riode, j&#8217;ai aussi appris une chose ou deux sur
              le fonctionnement des projets open source. De par cette exp&eacute;rience, j&#8217;ai
              constat&eacute; que les gens ignorent souvent qu&#8217;il y a plusieurs fa&ccedil;ons de contribuer &agrave; un
              projet open source, et qu&#8217;&eacute;crire du code n&#8217;en est qu&#8217;une parmi d&#8217;autres. On
              peut en parler autour de soi, aider les autres utilisateurs, organiser des
              conf&eacute;rences, et bien s&ucirc;r, on peut r&eacute;diger de la documentation.
         </p>
         <p>En cela, John est une personne importante au sein de la communaut&eacute; Jenkins,
              m&ecirc;me s&#8217;il n&#8217;a pas fourni de code, il rend Jenkins plus
              accessible aux nouveaux utilisateurs. Par exemple, il a un blog
              populaire qui est suivi par de nombreuses personnes, sur lequel il parle r&eacute;guli&egrave;rement des
              pratiques li&eacute;es &agrave; l&#8217;int&eacute;gration continue, ainsi que d&#8217;autres sujets li&eacute;s au d&eacute;veloppement
              logiciel. Il a vraiment un talent pour expliquer les choses afin que m&ecirc;me des
              utilisateurs n&eacute;ophytes puissent les comprendre, ce qui est souvent difficile
              pour des gens comme moi qui d&eacute;veloppent Jenkins jour apr&egrave;s jour. Il est aussi
              connu pour ses formations, dont Jenkins fait partie. C&#8217;est encore une autre
              fa&ccedil;on par laquelle il rend Jenkins accessible &agrave; davantage de personnes. Il a
              clairement une passion pour &eacute;vang&eacute;liser de nouvelles id&eacute;es et enseigner &agrave;
              ses pairs d&eacute;veloppeurs comment &ecirc;tre plus productifs.
         </p>
         <p>Ces temps-ci je consacre mon temps chez CloudBees &agrave; la version open
              source de Jenkins ainsi qu&#8217;&agrave; la version pro sur laquelle nous construisons des
              plugins, et &agrave; faire fonctionner Jenkins dans les <span class="emphasis"><em>clouds</em></span>
              priv&eacute;s et publics via le service DEV@cloud de CloudBees. Avec ce r&ocirc;le, j&#8217;ai
              maintenant une plus grande interaction avec John qu&#8217;auparavant, et mon respect pour
              sa passion n&#8217;a fait qu&#8217;augmenter.
         </p>
         <p>Je fus donc v&eacute;ritablement ravi qu&#8217;il prenne en charge l&#8217;immense t&acirc;che
              que repr&eacute;sente l&#8217;&eacute;criture d&#8217;un livre sur Jenkins. Cela donne une formidable vue
              d&#8217;ensemble sur les principaux ingr&eacute;dients de l&#8217;int&eacute;gration continue. En plus, &agrave; titre
              personnel, vu que l&#8217;on me demande souvent s&#8217;il y a un livre sur Jenkins, je
              peux enfin r&eacute;pondre &agrave; cette question par l&#8217;affirmative ! Mais plus
              important encore, ce livre refl&egrave;te, entre autre, sa passion et sa longue exp&eacute;rience
              dans l&#8217;enseignement de Jenkins. Mais ne me croyez pas sur
              parole, vous devrez le lire pour le voir par vous-m&ecirc;me.
         </p>
         <div class="footnotes"><br><hr width="100" align="left">
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e192" href="#d0e192">1</a>] </sup>Note des traducteurs : nous n&#8217;avons pas traduit le terme <span class="emphasis"><em>build</em></span> car nous n&#8217;avons pas trouv&eacute; de traduction pertinente et parce que ce terme reste majoritairement utilis&eacute; dans les m&eacute;tiers
                  des TI.
               </p>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="copyright.html">Prev</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="h" href="book.html">Home</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="preface.html">Next</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">Copyright&nbsp;</td>
               <td width="20%" align="center"><span style="color:white;font-size:90%;"><a href="http://www.sonatype.com/" title="Sonatype: Build Success for your Enterprise">Sponsored by Sonatype
                                                                </a></span></td>
               <td width="40%" align="right" valign="top">&nbsp;Pr&eacute;face</td>
            </tr>
         </table>
      </div>
   </body>
</html>