<html xmlns:fo="http://www.w3.org/1999/XSL/Format">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>2.&nbsp;Organisation du livre</title>
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="book.html" title="Jenkins : Le guide complet">
      <link rel="up" href="preface.html" title="Pr&eacute;face">
      <link rel="prev" href="preface.html" title="Pr&eacute;face">
      <link rel="next" href="I_sect1_d1e190.html" title="3.&nbsp;Jenkins ou Hudson?">
   </head>
   <body>
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="preface.html">Pr&eacute;face</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="h" href="book.html">
                     												TOC
                                                     </a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="I_sect1_d1e190.html">3.&nbsp;Jenkins ou Hudson?</a></td>
            </tr>
         </table>
      </div>
      <div class="sect1" lang="en">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="I_sect1_d1e185"></a>2.&nbsp;Organisation du livre
                  </h2>
               </div>
            </div>
         </div>
         <p>L'Int&eacute;gration Continue ressemble &agrave; beaucoup d'autres choses : plus
            vous investissez dessus, plus vous en tirerez de b&eacute;n&eacute;fices. Bien qu'une
            configuration d'Int&eacute;gration Continue basique produira tout de m&ecirc;me des
            am&eacute;liorations dans le fonctionnement de votre &eacute;quipe, il est aussi tr&egrave;s
            avantageux d'assimiler et d'impl&eacute;menter graduellement quelques-unes des
            techniques avanc&eacute;es. Dans ce but, ce livre est organis&eacute; comme un trek
            progressif dans le monde de l'Int&eacute;gration Continue avec Jenkins, allant du
            plus simple au plus avanc&eacute;. Dans le premier chapitre, nous effectuerons un
            balayage de tout ce qui fait Jenkins, sous la forme d'une promenade &agrave;
            haut-niveau. Ensuite, nous progresserons dans l'installation et la
            configuration de votre serveur Jenkins et expliquerons comment configurer
            des t&acirc;ches de build basiques. Une fois que nous aurons ma&icirc;tris&eacute; les bases,
            nous explorerons des sujets plus avanc&eacute;s, en passant par les tests
            automatis&eacute;s, la s&eacute;curit&eacute;, des techniques avanc&eacute;es de notification et la
            mesure et les rapports sur les m&eacute;triques de qualit&eacute; de code. Ensuite, nous
            passerons &agrave; des techniques de construction plus pouss&eacute;es comme les matrix
            builds, les builds distribu&eacute;s et l'IC bas&eacute;e sur le Cloud, avant de parler
            de l'impl&eacute;mentation du d&eacute;ploiement continu avec Jenkins. Et enfin, nous
                traiterons des astuces pour la maintenance de votre serveur
                Jenkins.
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="preface.html">Prev</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="h" href="book.html">Home</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="I_sect1_d1e190.html">Next</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">Pr&eacute;face&nbsp;</td>
               <td width="20%" align="center"><span style="color:white;font-size:90%;"><a href="http://www.sonatype.com/" title="Sonatype: Build Success for your Enterprise">Sponsored by Sonatype
                                                                </a></span></td>
               <td width="40%" align="right" valign="top">&nbsp;3.&nbsp;Jenkins ou Hudson?</td>
            </tr>
         </table>
      </div>
   </body>
</html>