<html xmlns:fo="http://www.w3.org/1999/XSL/Format">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>8.&nbsp;Sponsors du livre</title>
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="book.html" title="Jenkins : Le guide complet">
      <link rel="up" href="preface.html" title="Pr&eacute;face">
      <link rel="prev" href="I_sect1_d1e356.html" title="7.&nbsp;L'&eacute;quipe de revue">
      <link rel="next" href="I_sect1_d1e420.html" title="9.&nbsp;Utilisation des exemples de code">
   </head>
   <body>
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="I_sect1_d1e356.html">7.&nbsp;L'&eacute;quipe de revue</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="h" href="book.html">
                     												TOC
                                                              </a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="I_sect1_d1e420.html">9.&nbsp;Utilisation des exemples de code</a></td>
            </tr>
         </table>
      </div>
      <div class="sect1" lang="en">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="I_sect1_d1e364"></a>8.&nbsp;Sponsors du livre
                  </h2>
               </div>
            </div>
         </div>
         <p>Ce <a class="indexterm" name="I_indexterm_d1e369"></a>livre n'aurait pas &eacute;t&eacute; possible sans l'aide de plusieurs
                organisations qui &eacute;taient d&eacute;sireuses d'assister et de subventionner le
                processus d'&eacute;criture.
         </p>
         <div class="sect2" lang="en">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e462"></a>8.1.&nbsp;Wakaleo Consulting
                     </h3>
                  </div>
               </div>
            </div>
            <p><a xmlns:xlink="http://www.w3.org/1999/xlink" href="http://www.wakaleo.com" target="_top">Wakaleo Consulting</a>
                     <a class="indexterm" name="I_indexterm_d1e380"></a>est une entreprise de consulting qui aide les
                     organisations &agrave; optimiser leur processus de d&eacute;veloppement logiciel.
                     Dirig&eacute;e par John Ferguson Smart, auteur de ce livre et de <a xmlns:xlink="http://www.w3.org/1999/xlink" href="http://oreilly.com/catalog/9780596527938" target="_top"><span class="emphasis"><em>Java Power
                              Tools</em></span></a>, Wakaleo Consulting fournit des services de
                     consulting, de formation et de mentoring dans le d&eacute;veloppement Agile
                     Java et dans les pratiques de test, l'optimisation de cycle vie de
                     d&eacute;veloppement logiciel et les m&eacute;thodes Agiles.
            </p>
            <p>Wakaleo aide les entreprises avec des formations et de
                     l'assistance dans des domaines comme l'Int&eacute;gration Continue,
                     l'automatisation de build, le d&eacute;veloppement guid&eacute; par les tests, les tests
                     Web automatis&eacute;s et le code propre, en utilisant des outils open source
                     tels que Maven, Jenkins, Selenium 2 et Nexus. Wakaleo Consulting donne
                     aussi des formations publiques et sur site autour de l'Int&eacute;gration
                     Continue et le D&eacute;ploiement Continu, l'automatisation de build, les
                     pratiques de codage propre, le d&eacute;veloppement guid&eacute; par les tests (TDD)
                     et le Behavior-Driven Development, incluant des cours Certified Scrum
                     Developer (CSD).
            </p>
         </div>
         <div class="sect2" lang="en">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e479"></a>8.2.&nbsp;CloudBees
                     </h3>
                  </div>
               </div>
            </div>
            <p><a xmlns:xlink="http://www.w3.org/1999/xlink" href="http://www.cloudbees.com" target="_top">CloudBees</a> <a class="indexterm" name="I_indexterm_d1e397"></a>est la seule entreprise sp&eacute;cialis&eacute;e pour offrir un service
                     de gestion du cycle de vie, depuis le d&eacute;veloppement jusqu'au d&eacute;ploiement,
                     d'applications Java web dans le cloud. L'entreprise est aussi l'experte
                     mondiale sur l'outil d'int&eacute;gration continue Jenkins/Hudson.
            </p>
            <p>Le cr&eacute;ateur de Jenkins/Hudson Kohsuke Kawaguchi dirige une &eacute;quipe
                     d'experts CloudBees &agrave; travers le monde. Ils ont cr&eacute;&eacute; Nectar, une version
                     support&eacute;e et am&eacute;lior&eacute;e de Jenkins disponible par abonnement. Si vous
                     d&eacute;pendez de Jenkins pour des processus logiciels critiques, Nectar
                     fournit une version hautement test&eacute;e, stable et totalement support&eacute;e de
                     Jenkins. Cela inclut aussi des fonctionnalit&eacute;s disponibles seulement
                     dans Nectar comme le <span class="emphasis"><em>scaling</em></span> automatique de
                     machines virtuelles VMWare.
            </p>
            <p>Si vous &ecirc;tes pr&ecirc;ts &agrave; explorer la puissance de l'Int&eacute;gration
                     Continue dans le cloud, CloudBees propose Jenkins/Hudson comme brique de
                     sa plateforme de build DEV@cloud. Vous pouvez d&eacute;marrer avec Jenkins
                     instantan&eacute;ment et vous pouvez monter en puisssance comme vous le
                     souhaitez &#8212; pas de gros investissements d&egrave;s le d&eacute;but dans vos serveurs de
                     build, plus de capacit&eacute;s limit&eacute;es pour vos builds et plus de soucis de
                     maintenance. Une fois qu'une application est pr&ecirc;te &agrave; partir, vous pouvez
                     la d&eacute;ployer sur l'offre Platform as a Service CloudBees RUN@cloud en
                     seulement quelques clics.
            </p>
            <p>Avec les services CloudBees DEV@cloud et RUN@cloud, vous n'avez
                     pas &agrave; vous soucier des serveurs, machines virtuelles ou des &eacute;quipes
                     informatique. Et avec Nectar, vous profitez du Jenkins le plus puissant,
                     stable et support&eacute; existant.
            </p>
         </div>
         <div class="sect2" lang="en">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="d0e499"></a>8.3.&nbsp;Odd-e
                     </h3>
                  </div>
               </div>
            </div>
            <p><a xmlns:xlink="http://www.w3.org/1999/xlink" href="http://www.odd-e.com" target="_top">Odd-e</a> est<a class="indexterm" name="I_indexterm_d1e414"></a> une entreprise bas&eacute;e en Asie qui construit des produits
                     de fa&ccedil;on innovante et aide les autres &agrave; faire de m&ecirc;me. L'&eacute;quipe est
                     compos&eacute;e de coaches exp&eacute;riment&eacute;s et de d&eacute;veloppeurs produit travaillant
                     dans des valeurs scrum, agile, lean, et artisan du logiciel, et
                     l'entreprise est structur&eacute;e de la m&ecirc;me fa&ccedil;on. Par exemple, Odd-e n'a pas
                     d'organisation hi&eacute;rarchique de responsables prenant les d&eacute;cisions pour
                     les autres. Au lieu de cela, les individus s'organisent eux-m&ecirc;mes et
                     utilisent leurs talents pour constamment am&eacute;liorer leurs comp&eacute;tences.
                     L'entreprise propose des formations et du coaching suivi pour aider les
                     autres &agrave; chercher et d&eacute;velopper une meilleure fa&ccedil;on de
                     travailler.
            </p>
            <p>Ce n'est pas le travail mais les valeurs qui lient Odd-e. Ses
                     membres adorent construire du logiciel, accordent davantage d'importance
                     &agrave; l'apprentissage et la contribution qu'&agrave; la maximisation du profit, et
                     ont d&eacute;cid&eacute; de supporter le d&eacute;veloppement open source en Asie.
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="I_sect1_d1e356.html">Prev</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="h" href="book.html">Home</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="I_sect1_d1e420.html">Next</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">7.&nbsp;L'&eacute;quipe de revue&nbsp;</td>
               <td width="20%" align="center"><span style="color:white;font-size:90%;"><a href="http://www.sonatype.com/" title="Sonatype: Build Success for your Enterprise">Sponsored by Sonatype
                                                                </a></span></td>
               <td width="40%" align="right" valign="top">&nbsp;9.&nbsp;Utilisation des exemples de code</td>
            </tr>
         </table>
      </div>
   </body>
</html>