<html xmlns:fo="http://www.w3.org/1999/XSL/Format">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>12.&nbsp;Remerciements</title>
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="book.html" title="Jenkins : Le guide complet">
      <link rel="up" href="preface.html" title="Pr&eacute;face">
      <link rel="prev" href="I_sect1_d1e468.html" title="11.&nbsp;Comment nous contacter">
      <link rel="next" href="intro.html" title="Chapter&nbsp;1.&nbsp;Introduction &agrave; Jenkins">
   </head>
   <body>
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="I_sect1_d1e468.html">11.&nbsp;Comment nous contacter</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="h" href="book.html">
                     												TOC
                                                                 </a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="intro.html">Chapter&nbsp;1.&nbsp;Introduction &agrave; Jenkins</a></td>
            </tr>
         </table>
      </div>
      <div class="sect1" lang="en">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="I_sect1_d1e514"></a>12.&nbsp;Remerciements
                  </h2>
               </div>
            </div>
         </div>
         <p>Pour commencer et avant tout, &agrave; ma merveilleuse femme, et aux
                gar&ccedil;ons, James et William, sans qui, gr&acirc;ce &agrave; leur amour, leur soutien et
                leur tol&eacute;rence, ce livre n'aurait pas &eacute;t&eacute; possible.
         </p>
         <p>J'aimerais remercier Mike Loukides pour avoir travaill&eacute; avec moi une
                fois de plus sur ce projet de livre, et toute l'&eacute;quipe O&#8217;Reilly pour leur
                haut niveau de travail.
         </p>
         <p>Merci &agrave; Kohsuke Kawaguchi d'avoir cr&eacute;&eacute; Jenkins, et d'&ecirc;tre encore la
                force motrice derri&egrave;re ce brillant produit. Merci aussi &agrave; Fran&ccedil;ois
                Dechery, Sacha Labourey, Harpreet Singh et le reste de l'&eacute;quipe CloudBees
                pour leur aide et leur soutien.
         </p>
         <p>Je suis aussi tr&egrave;s reconnaissant envers ceux qui ont consacr&eacute; du
                temps et de l'&eacute;nergie pour contribuer &agrave; ce livre : Evgeny Goldin,
                Matthew McCullough, Juven Xu, et Rene Groeschke.
         </p>
         <p>Un grand merci revient aux relecteurs suivants, qui ont fourni des
                retours de grande valeur tout le long du processus d'&eacute;criture : Alan
                Harder, Andrew Bayer, Carlo Bonamico, Chris Graham, Eric Smalling, Gregory
                Boissinot, Harald Soevik, Julien Simpson, Juven Xu, Kohsuke Kawaguchi,
                Martijn Verberg, Ross Rowe, et Tyler Ballance.
         </p>
         <p>Merci &agrave; Andrew Bayer, Martijn Verburg, Matthew McCullough, Rob
                Purcell, Ray King, Andrew Walker, et beaucoup d'autres, dont les
                discussions et les retours m'ont fourni l'inspiration et les id&eacute;es qui ont
                fait de ce livre ce qu'il est.
         </p>
         <p>Et beaucoup d'autres personnes ont aid&eacute; de diff&eacute;rentes fa&ccedil;ons pour
                enrichir et compl&eacute;ter ce livre tel qu'il n'aurait pu l'&ecirc;tre autrement :
                Geoff et Alex Bullen, Pete Thomas, Gordon Weir, Jay Zimmerman, Tim
                O&#8217;Brien, Russ Miles, Richard Paul, Julien Simpson, John Stevenson, Michael
                Neale, Arnaud H&eacute;ritier, et Manfred Moser.
         </p>
         <p>Et enfin un grand merci aux d&eacute;veloppeurs et &agrave; la communaut&eacute;
                utilisateur de Hudson/Jenkins pour les encouragements et le soutien
                constants.
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="I_sect1_d1e468.html">Prev</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="h" href="book.html">Home</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="intro.html">Next</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">11.&nbsp;Comment nous contacter&nbsp;</td>
               <td width="20%" align="center"><span style="color:white;font-size:90%;"><a href="http://www.sonatype.com/" title="Sonatype: Build Success for your Enterprise">Sponsored by Sonatype
                                                                </a></span></td>
               <td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;1.&nbsp;Introduction &agrave; Jenkins</td>
            </tr>
         </table>
      </div>
   </body>
</html>