<html xmlns:fo="http://www.w3.org/1999/XSL/Format">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>1.3.&nbsp;Introduction &agrave; Jenkins (n&eacute; Hudson)</title>
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="book.html" title="Jenkins : Le guide complet">
      <link rel="up" href="intro.html" title="Chapter&nbsp;1.&nbsp;Introduction &agrave; Jenkins">
      <link rel="prev" href="intro-sect-intro.html" title="1.2.&nbsp;Les fondamentaux de l'Int&eacute;gration Continue">
      <link rel="next" href="intro-sect-history.html" title="1.4.&nbsp;De Hudson &agrave; Jenkins &#8212; Un rapide historique">
   </head>
   <body>
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="intro-sect-intro.html">1.2.&nbsp;Les fondamentaux de l'Int&eacute;gration Continue</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="h" href="book.html">
                     												TOC
                                                                 </a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="intro-sect-history.html">1.4.&nbsp;De Hudson &agrave; Jenkins &#8212; Un rapide historique</a></td>
            </tr>
         </table>
      </div>
      <div class="sect1" lang="en">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="intro-sect-introducing-jenkins"></a>1.3.&nbsp;Introduction &agrave; Jenkins (n&eacute; Hudson)
                  </h2>
               </div>
            </div>
         </div>
         <p>Jenkins, <a class="indexterm" name="ch01-jenkins"></a>qui s'appelait &agrave; l'origine <a class="indexterm" name="I_indexterm1_d1e608"></a>Hudson, est un outil d'Int&eacute;gration Continue 
            open source &eacute;crit en Java. B&eacute;n&eacute;ficiant d'une part de march&eacute; dominante, 
            Jenkins est utilis&eacute; par des &eacute;quipes de toutes tailles, pour des projets 
                dans des langages et des technologies vari&eacute;s, incluant .NET, Ruby, 
                Groovy, Grails, PHP et d'autres, ainsi que Java bien s&ucirc;r. Qu'est ce 
                qui est &agrave; l'origine du succ&egrave;s de Jenkins ? Pourquoi utiliser Jenkins
                pour votre infrastructure d'IC ?
         </p>
         <p>Tout d'abord, Jenkins est facile &agrave; utiliser. L'interface utilisateur
                est simple, intuitive et visuellement agr&eacute;able, et Jenkins dans son ensemble
                a une tr&egrave;s petite courbe d'apprentissage. Comme nous le verrons dans 
                le chapitre suivant, vous pouvez d&eacute;marrer avec jenkins en quelques 
                minutes.
         </p>
         <p>Cependant jenkins n'a pas sacrifi&eacute; puissance ou extensibilit&eacute; : il est aussi
                extr&ecirc;mement flexible et s'adapte facilement &agrave; vos moindres d&eacute;sirs. Des 
                centaines d'extensions open source sont disponibles, et de nouvelles 
                aparaissent toutes les semaines. Ces extensions couvrent tout : les
                outils de gestion de configuration, les outils de build, les m&eacute;triques de
                qualit&eacute; de code, les annonceurs de build, l'int&eacute;gration avec des 
                syst&egrave;mes externes, la personalisation de l'interface utilisateur, des 
                jeux et bien d'autres fonctionnalit&eacute;s encore. Les installer est simple et rapide.
         </p>
         <p>Enfin, mais ce n'est pas n&eacute;gligeable, une bonne part de la 
                popularit&eacute; de Jenkins vient de la taille <span class="keep-together">et</span> du
                dynamisme de sa communaut&eacute;. La communaut&eacute; Jenkins est immense, dynamique, 
                r&eacute;active et c'est un groupe <span class="keep-together">accueillant</span>, avec
                ses champions passionn&eacute;s, ses listes de diffusion actives, ses canaux IRC et 
                son blog et son compte twitter tr&egrave;s bruyants. Le rythme de d&eacute;veloppement
                est tr&egrave;s intense, avec des livraisons hebdomadaires comportant les derni&egrave;res
                &eacute;volutions, corrections et mises &agrave; jour des extensions.
         </p>
         <p>Cependant, Jenkins r&eacute;pond tout aussi bien aux attentes des utilisateurs qui ne 
                souhaitent pas mettre &agrave; jour toutes les semaines. Pour ceux qui veulent un rythme moins tr&eacute;pidant,
                il existe une version Long-term Support, ou <a class="indexterm" name="I_indexterm1_d1e628"></a>LTS. Il s'agit d'un ensemble
                de versions qui sont &agrave; la traine par rapport &agrave; la toute derni&egrave;re en termes de nouveaut&eacute;s 
                mais qui apportent plus de stabilit&eacute; et moins de changements. Les versions LTS
                sortent environ tous les trois mois, les correctifs importants y sont 
                int&eacute;gr&eacute;s. Ce concept est identique aux <span class="keep-together">versions</span> Ubuntu LTS .
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="intro-sect-intro.html">Prev</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="h" href="book.html">Home</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="intro-sect-history.html">Next</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">1.2.&nbsp;Les fondamentaux de l'Int&eacute;gration Continue&nbsp;</td>
               <td width="20%" align="center"><span style="color:white;font-size:90%;"><a href="http://www.sonatype.com/" title="Sonatype: Build Success for your Enterprise">Sponsored by Sonatype
                                                                </a></span></td>
               <td width="40%" align="right" valign="top">&nbsp;1.4.&nbsp;De Hudson &agrave; Jenkins &#8212; Un rapide historique</td>
            </tr>
         </table>
      </div>
   </body>
</html>